In [87]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [32]:
import glob

all_dfs = []

for one_filename in glob.glob('../data/*,*.csv'):
    print(f'Loading {one_filename}')

    names = ['date_time', 'max_temp', 'min_temp']
    city, state = (
        one_filename.removeprefix('../data/').removesuffix('.csv').split(',')
    )
    
    one_df = (
        pd
        .read_csv(one_filename, 
                  usecols=[0,1,2], 
                  names=names,
                 header=0)
        .assign(city=city.replace('+', ' ').title(),
                state=state.upper())
                
    )
    all_dfs.append(one_df)

Loading ../data/san+francisco,ca.csv
Loading ../data/new+york,ny.csv
Loading ../data/springfield,ma.csv
Loading ../data/boston,ma.csv
Loading ../data/springfield,il.csv
Loading ../data/albany,ny.csv
Loading ../data/los+angeles,ca.csv
Loading ../data/chicago,il.csv

In [33]:
all_dfs

[               date_time  max_temp  min_temp           city state
 0    2018-12-11 00:00:00        13         8  San Francisco    CA
 1    2018-12-11 03:00:00        13         8  San Francisco    CA
 2    2018-12-11 06:00:00        13         8  San Francisco    CA
 3    2018-12-11 09:00:00        13         8  San Francisco    CA
 4    2018-12-11 12:00:00        13         8  San Francisco    CA
 ..                   ...       ...       ...            ...   ...
 723  2019-03-11 09:00:00        12         8  San Francisco    CA
 724  2019-03-11 12:00:00        12         8  San Francisco    CA
 725  2019-03-11 15:00:00        12         8  San Francisco    CA
 726  2019-03-11 18:00:00        12         8  San Francisco    CA
 727  2019-03-11 21:00:00        12         8  San Francisco    CA

 [728 rows x 5 columns],
                date_time  max_temp  min_temp      city state
 0    2018-12-11 00:00:00         4        -1  New York    NY
 1    2018-12-11 03:00:00         4        -1  New York    NY
 2    2018-12-11 06:00:00         4        -1  New York    NY
 3    2018-12-11 09:00:00         4        -1  New York    NY
 4    2018-12-11 12:00:00         4        -1  New York    NY
 ..                   ...       ...       ...       ...   ...
 723  2019-03-11 09:00:00         6         2  New York    NY
 724  2019-03-11 12:00:00         6         2  New York    NY
 725  2019-03-11 15:00:00         6         2  New York    NY
 726  2019-03-11 18:00:00         6         2  New York    NY
 727  2019-03-11 21:00:00         6         2  New York    NY

 [728 rows x 5 columns],
                date_time  max_temp  min_temp         city state
 0    2018-12-11 00:00:00         1        -7  Springfield    MA
 1    2018-12-11 03:00:00         1        -7  Springfield    MA
 2    2018-12-11 06:00:00         1        -7  Springfield    MA
 3    2018-12-11 09:00:00         1        -7  Springfield    MA
 4    2018-12-11 12:00:00         1        -7  Springfield    MA
 ..                   ...       ...       ...          ...   ...
 723  2019-03-11 09:00:00         5        -2  Springfield    MA
 724  2019-03-11 12:00:00         5        -2  Springfield    MA
 725  2019-03-11 15:00:00         5        -2  Springfield    MA
 726  2019-03-11 18:00:00         5        -2  Springfield    MA
 727  2019-03-11 21:00:00         5        -2  Springfield    MA

 [728 rows x 5 columns],
                date_time  max_temp  min_temp    city state
 0    2018-12-11 00:00:00         1        -4  Boston    MA
 1    2018-12-11 03:00:00         1        -4  Boston    MA
 2    2018-12-11 06:00:00         1        -4  Boston    MA
 3    2018-12-11 09:00:00         1        -4  Boston    MA
 4    2018-12-11 12:00:00         1        -4  Boston    MA
 ..                   ...       ...       ...     ...   ...
 723  2019-03-11 09:00:00         8         2  Boston    MA
 724  2019-03-11 12:00:00         8         2  Boston    MA
 725  2019-03-11 15:00:00         8         2  Boston    MA
 726  2019-03-11 18:00:00         8         2  Boston    MA
 727  2019-03-11 21:00:00         8         2  Boston    MA

 [728 rows x 5 columns],
                date_time  max_temp  min_temp         city state
 0    2018-12-11 00:00:00         5        -3  Springfield    IL
 1    2018-12-11 03:00:00         5        -3  Springfield    IL
 2    2018-12-11 06:00:00         5        -3  Springfield    IL
 3    2018-12-11 09:00:00         5        -3  Springfield    IL
 4    2018-12-11 12:00:00         5        -3  Springfield    IL
 ..                   ...       ...       ...          ...   ...
 723  2019-03-11 09:00:00         2        -6  Springfield    IL
 724  2019-03-11 12:00:00         2        -6  Springfield    IL
 725  2019-03-11 15:00:00         2        -6  Springfield    IL
 726  2019-03-11 18:00:00         2        -6  Springfield    IL
 727  2019-03-11 21:00:00         2        -6  Springfield    IL

 [728 rows x 5 columns],
                date_time  max_temp  min_temp    city state
 0    2018-12-11 00:00:00        -2        -8  Albany    NY
 1    2018-12-11 03:00:00        -2        -8  Albany    NY
 2    2018-12-11 06:00:00        -2        -8  Albany    NY
 3    2018-12-11 09:00:00        -2        -8  Albany    NY
 4    2018-12-11 12:00:00        -2        -8  Albany    NY
 ..                   ...       ...       ...     ...   ...
 723  2019-03-11 09:00:00         4        -1  Albany    NY
 724  2019-03-11 12:00:00         4        -1  Albany    NY
 725  2019-03-11 15:00:00         4        -1  Albany    NY
 726  2019-03-11 18:00:00         4        -1  Albany    NY
 727  2019-03-11 21:00:00         4        -1  Albany    NY

 [728 rows x 5 columns],
                date_time  max_temp  min_temp         city state
 0    2018-12-11 00:00:00        20        14  Los Angeles    CA
 1    2018-12-11 03:00:00        20        14  Los Angeles    CA
 2    2018-12-11 06:00:00        20        14  Los Angeles    CA
 3    2018-12-11 09:00:00        20        14  Los Angeles    CA
 4    2018-12-11 12:00:00        20        14  Los Angeles    CA
 ..                   ...       ...       ...          ...   ...
 723  2019-03-11 09:00:00        19        12  Los Angeles    CA
 724  2019-03-11 12:00:00        19        12  Los Angeles    CA
 725  2019-03-11 15:00:00        19        12  Los Angeles    CA
 726  2019-03-11 18:00:00        19        12  Los Angeles    CA
 727  2019-03-11 21:00:00        19        12  Los Angeles    CA

 [728 rows x 5 columns],
                date_time  max_temp  min_temp     city state
 0    2018-12-11 00:00:00         1        -2  Chicago    IL
 1    2018-12-11 03:00:00         1        -2  Chicago    IL
 2    2018-12-11 06:00:00         1        -2  Chicago    IL
 3    2018-12-11 09:00:00         1        -2  Chicago    IL
 4    2018-12-11 12:00:00         1        -2  Chicago    IL
 ..                   ...       ...       ...      ...   ...
 723  2019-03-11 09:00:00         3        -2  Chicago    IL
 724  2019-03-11 12:00:00         3        -2  Chicago    IL
 725  2019-03-11 15:00:00         3        -2  Chicago    IL
 726  2019-03-11 18:00:00         3        -2  Chicago    IL
 727  2019-03-11 21:00:00         3        -2  Chicago    IL

 [728 rows x 5 columns]]

In [34]:
df = pd.concat(all_dfs)

In [35]:
df.head()

             date_time  max_temp  min_temp           city state
0  2018-12-11 00:00:00        13         8  San Francisco    CA
1  2018-12-11 03:00:00        13         8  San Francisco    CA
2  2018-12-11 06:00:00        13         8  San Francisco    CA
3  2018-12-11 09:00:00        13         8  San Francisco    CA
4  2018-12-11 12:00:00        13         8  San Francisco    CA

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5824 entries, 0 to 727
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date_time  5824 non-null   object
 1   max_temp   5824 non-null   int64
 2   min_temp   5824 non-null   int64
 3   city       5824 non-null   object
 4   state      5824 non-null   object
dtypes: int64(2), object(3)
memory usage: 273.0+ KB

Does the data for each city and state start and end at (roughly) the same time?
How do you know?

In [52]:
df.groupby(['state', 'city'])['date_time'].min().sort_values()

state  city
CA     Los Angeles      2018-12-11 00:00:00
       San Francisco    2018-12-11 00:00:00
IL     Chicago          2018-12-11 00:00:00
       Springfield      2018-12-11 00:00:00
MA     Boston           2018-12-11 00:00:00
       Springfield      2018-12-11 00:00:00
NY     Albany           2018-12-11 00:00:00
       New York         2018-12-11 00:00:00
Name: date_time, dtype: object

In [54]:
df.groupby(['state', 'city'])['date_time'].max().sort_values()

state  city
CA     Los Angeles      2019-03-11 21:00:00
       San Francisco    2019-03-11 21:00:00
IL     Chicago          2019-03-11 21:00:00
       Springfield      2019-03-11 21:00:00
MA     Boston           2019-03-11 21:00:00
       Springfield      2019-03-11 21:00:00
NY     Albany           2019-03-11 21:00:00
       New York         2019-03-11 21:00:00
Name: date_time, dtype: object

What is the lowest minimum temperature recorded for each city in the data set?

In [46]:
df.groupby(['state', 'city'])['min_temp'].min()

state  city
CA     Los Angeles       4
       San Francisco     3
IL     Chicago         -28
       Springfield     -25
MA     Boston          -14
       Springfield     -20
NY     Albany          -19
       New York        -14
Name: min_temp, dtype: int64

What is the highest maximum temperature recorded in each state in the data set?

In [49]:
df.groupby('state')['max_temp'].max()

state
CA    23
IL    16
MA    17
NY    15
Name: max_temp, dtype: int64

In [58]:
df.groupby(['state','city'])['max_temp'].agg(['min','max'])

                     min  max
state city
CA    Los Angeles     12   23
      San Francisco    9   15
IL    Chicago        -25    9
      Springfield    -20   16
MA    Boston         -12   17
      Springfield    -16   15
NY    Albany         -14   13
      New York       -12   15

In [60]:
# wrong? from book, page 200
df.groupby(['state','city'])['date_time'].agg(['min','max'])

                                     min                  max
state city
CA    Los Angeles    2018-12-11 00:00:00  2019-03-11 21:00:00
      San Francisco  2018-12-11 00:00:00  2019-03-11 21:00:00
IL    Chicago        2018-12-11 00:00:00  2019-03-11 21:00:00
      Springfield    2018-12-11 00:00:00  2019-03-11 21:00:00
MA    Boston         2018-12-11 00:00:00  2019-03-11 21:00:00
      Springfield    2018-12-11 00:00:00  2019-03-11 21:00:00
NY    Albany         2018-12-11 00:00:00  2019-03-11 21:00:00
      New York       2018-12-11 00:00:00  2019-03-11 21:00:00

# Beyond 1
Run describe on the minimum and maximum temperature for each state-city
combination.

In [65]:
df.groupby(['state','city'])[['min_temp','max_temp']].describe()

                    min_temp                                               \
                       count       mean       std   min   25%   50%   75%
state city
CA    Los Angeles      728.0  10.637363  2.705200   4.0   9.0  11.0  12.0
      San Francisco    728.0   8.252747  2.021036   3.0   7.0   8.0  10.0
IL    Chicago          728.0  -5.076923  6.255857 -28.0  -9.0  -4.0  -1.0
      Springfield      728.0  -4.857143  6.508184 -25.0  -8.0  -5.0  -1.0
MA    Boston           728.0  -3.142857  4.957195 -14.0  -6.0  -3.0   0.0
      Springfield      728.0  -6.032967  5.384681 -20.0 -10.0  -6.0  -2.0
NY    Albany           728.0  -5.956044  5.599984 -19.0 -10.0  -6.0  -2.0
      New York         728.0  -1.054945  5.025082 -14.0  -4.0   0.0   2.0

                          max_temp                                         \
                      max    count       mean       std   min   25%   50%
state city
CA    Los Angeles    17.0    728.0  17.054945  2.708640  12.0  15.0  16.0
      San Francisco  13.0    728.0  12.604396  1.437399   9.0  12.0  13.0
IL    Chicago         6.0    728.0  -0.736264  6.128985 -25.0  -3.0   0.0
      Springfield    10.0    728.0   2.076923  6.273423 -20.0  -2.0   2.0
MA    Boston          9.0    728.0   2.868132  4.945277 -12.0   0.0   2.0
      Springfield     6.0    728.0   1.472527  5.266678 -16.0  -2.0   2.0
NY    Albany          7.0    728.0   0.362637  5.294136 -14.0  -3.0   0.0
      New York       12.0    728.0   4.208791  4.619238 -12.0   2.0   4.0


                      75%   max
state city
CA    Los Angeles    19.0  23.0
      San Francisco  14.0  15.0
IL    Chicago         3.0   9.0
      Springfield     7.0  16.0
MA    Boston          6.0  17.0
      Springfield     4.0  15.0
NY    Albany          4.0  13.0
      New York        7.0  15.0

In [69]:
df.groupby(['state','city'])[['min_temp','max_temp']].apply(DataFrame.describe)

                           min_temp    max_temp
state city
CA    Los Angeles count  728.000000  728.000000
                  mean    10.637363   17.054945
                  std      2.705200    2.708640
                  min      4.000000   12.000000
                  25%      9.000000   15.000000
...                             ...         ...
NY    New York    min    -14.000000  -12.000000
                  25%     -4.000000    2.000000
                  50%      0.000000    4.000000
                  75%      2.000000    7.000000
                  max     12.000000   15.000000

[64 rows x 2 columns]

In [73]:
df.groupby(['state','city'])[['min_temp','max_temp']].apply(DataFrame.describe).shape

(64, 2)

Running describe works, but we only see the first and last few rows from each
result. Using pd.set_option to change the value of display_max_rows makes it
possible to see all the results in Jupyter. Then reset the option to 10 rows.

In [74]:
pd.set_option('display.max_rows', 64)

In [75]:
df.groupby(['state','city'])[['min_temp','max_temp']].apply(DataFrame.describe)

                             min_temp    max_temp
state city
CA    Los Angeles   count  728.000000  728.000000
                    mean    10.637363   17.054945
                    std      2.705200    2.708640
                    min      4.000000   12.000000
                    25%      9.000000   15.000000
                    50%     11.000000   16.000000
                    75%     12.000000   19.000000
                    max     17.000000   23.000000
      San Francisco count  728.000000  728.000000
                    mean     8.252747   12.604396
                    std      2.021036    1.437399
                    min      3.000000    9.000000
                    25%      7.000000   12.000000
                    50%      8.000000   13.000000
                    75%     10.000000   14.000000
                    max     13.000000   15.000000
IL    Chicago       count  728.000000  728.000000
                    mean    -5.076923   -0.736264
                    std      6.255857    6.128985
                    min    -28.000000  -25.000000
                    25%     -9.000000   -3.000000
                    50%     -4.000000    0.000000
                    75%     -1.000000    3.000000
                    max      6.000000    9.000000
      Springfield   count  728.000000  728.000000
                    mean    -4.857143    2.076923
                    std      6.508184    6.273423
                    min    -25.000000  -20.000000
                    25%     -8.000000   -2.000000
                    50%     -5.000000    2.000000
                    75%     -1.000000    7.000000
                    max     10.000000   16.000000
MA    Boston        count  728.000000  728.000000
                    mean    -3.142857    2.868132
                    std      4.957195    4.945277
                    min    -14.000000  -12.000000
                    25%     -6.000000    0.000000
                    50%     -3.000000    2.000000
                    75%      0.000000    6.000000
                    max      9.000000   17.000000
      Springfield   count  728.000000  728.000000
                    mean    -6.032967    1.472527
                    std      5.384681    5.266678
                    min    -20.000000  -16.000000
                    25%    -10.000000   -2.000000
                    50%     -6.000000    2.000000
                    75%     -2.000000    4.000000
                    max      6.000000   15.000000
NY    Albany        count  728.000000  728.000000
                    mean    -5.956044    0.362637
                    std      5.599984    5.294136
                    min    -19.000000  -14.000000
                    25%    -10.000000   -3.000000
                    50%     -6.000000    0.000000
                    75%     -2.000000    4.000000
                    max      7.000000   13.000000
      New York      count  728.000000  728.000000
                    mean    -1.054945    4.208791
                    std      5.025082    4.619238
                    min    -14.000000  -12.000000
                    25%     -4.000000    2.000000
                    50%      0.000000    4.000000
                    75%      2.000000    7.000000
                    max     12.000000   15.000000

In [76]:
pd.set_option('display.max_rows', 10)

# Beyond 3
What is the average difference in temperature (i.e., max â€“ min) for each of the
cities in our data set?

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5824 entries, 0 to 727
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date_time  5824 non-null   object
 1   max_temp   5824 non-null   int64
 2   min_temp   5824 non-null   int64
 3   city       5824 non-null   object
 4   state      5824 non-null   object
 5   diff       5824 non-null   int64
dtypes: int64(3), object(3)
memory usage: 318.5+ KB

In [77]:
df.head()

             date_time  max_temp  min_temp           city state
0  2018-12-11 00:00:00        13         8  San Francisco    CA
1  2018-12-11 03:00:00        13         8  San Francisco    CA
2  2018-12-11 06:00:00        13         8  San Francisco    CA
3  2018-12-11 09:00:00        13         8  San Francisco    CA
4  2018-12-11 12:00:00        13         8  San Francisco    CA

In [78]:
df['diff'] = df['max_temp'] - df['min_temp']

In [79]:
df.head()

             date_time  max_temp  min_temp           city state  diff
0  2018-12-11 00:00:00        13         8  San Francisco    CA     5
1  2018-12-11 03:00:00        13         8  San Francisco    CA     5
2  2018-12-11 06:00:00        13         8  San Francisco    CA     5
3  2018-12-11 09:00:00        13         8  San Francisco    CA     5
4  2018-12-11 12:00:00        13         8  San Francisco    CA     5

In [81]:
df.groupby(['state', 'city'])['diff'].mean()

state  city
CA     Los Angeles      6.417582
       San Francisco    4.351648
IL     Chicago          4.340659
       Springfield      6.934066
MA     Boston           6.010989
       Springfield      7.505495
NY     Albany           6.318681
       New York         5.263736
Name: diff, dtype: float64

In [92]:
df.groupby(['state', 'city'])[['diff']].mean()

                         diff
state city
CA    Los Angeles    6.417582
      San Francisco  4.351648
IL    Chicago        4.340659
      Springfield    6.934066
MA    Boston         6.010989
      Springfield    7.505495
NY    Albany         6.318681
      New York       5.263736

In [85]:
df.groupby(['state', 'city'])[['min_temp', 'max_temp']].diff(axis=1 ).mean()  #.apply(lambda g: np.mean(g.max() - g.min()) )

/var/folders/mm/h2z28vhs6cdbnsksl2fzl19w0000gn/T/ipykernel_16201/2385408666.py:1: FutureWarning: DataFrameGroupBy.diff with axis=1 is deprecated and will be removed in a future version. Operate on the un-grouped DataFrame instead
  df.groupby(['state', 'city'])[['min_temp', 'max_temp']].diff(axis=1 ).mean()  #.apply(lambda g: np.mean(g.max() - g.min()) )

min_temp         NaN
max_temp    5.892857
dtype: float64

In [89]:
# We'll use lambda to calculate max-min for each value in the group, and then get the mean of those values
df.groupby(['state', 'city'])[['min_temp', 'max_temp']].apply(lambda g: np.mean(g.max() - g.min()) )

state  city
CA     Los Angeles      12.0
       San Francisco     8.0
IL     Chicago          34.0
       Springfield      35.5
MA     Boston           26.0
       Springfield      28.5
NY     Albany           26.5
       New York         26.5
dtype: float64

In [98]:
df.groupby(['state', 'city'])[['min_temp', 'max_temp']].apply(lambda g: np.mean(g.max() - g.min()) )

state  city
CA     Los Angeles      12.0
       San Francisco     8.0
IL     Chicago          34.0
       Springfield      35.5
MA     Boston           26.0
       Springfield      28.5
NY     Albany           26.5
       New York         26.5
dtype: float64

## Window functions (sidebar, page 201)

In [4]:
import pandas as pd
from pandas import DataFrame

In [6]:
df = DataFrame({'sales':[100, 150, 200, 250, 200, 150, 300, 400, 500, 100, 300, 200],
'quarters':'Q1 Q2 Q3 Q4'.split() * 3})
df.to_csv('window-functions.csv')
df

    sales quarters
0     100       Q1
1     150       Q2
2     200       Q3
3     250       Q4
4     200       Q1
5     150       Q2
6     300       Q3
7     400       Q4
8     500       Q1
9     100       Q2
10    300       Q3
11    200       Q4

In [107]:
df['sales'].sum()

2850

In [104]:
df['sales'].mean()

237.5

In [105]:
df.groupby('quarters')['sales'].mean()

quarters
Q1    266.666667
Q2    133.333333
Q3    266.666667
Q4    283.333333
Name: sales, dtype: float64

In [106]:
df['sales'].expanding().sum()

0      100.0
1      250.0
2      450.0
3      700.0
4      900.0
       ...
7     1750.0
8     2250.0
9     2350.0
10    2650.0
11    2850.0
Name: sales, Length: 12, dtype: float64

In [2]:
2850/12

237.5

In [108]:
df['sales'].expanding().mean()

0     100.000000
1     125.000000
2     150.000000
3     175.000000
4     180.000000
         ...
7     218.750000
8     250.000000
9     235.000000
10    240.909091
11    237.500000
Name: sales, Length: 12, dtype: float64

In [109]:
df['sales'].rolling(3).mean()

0            NaN
1            NaN
2     150.000000
3     200.000000
4     216.666667
         ...
7     283.333333
8     400.000000
9     333.333333
10    300.000000
11    200.000000
Name: sales, Length: 12, dtype: float64

In [110]:
df['sales'].pct_change()

0          NaN
1     0.500000
2     0.333333
3     0.250000
4    -0.200000
        ...
7     0.333333
8     0.250000
9    -0.800000
10    2.000000
11   -0.333333
Name: sales, Length: 12, dtype: float64

In [111]:
df['sales'].diff()

0       NaN
1      50.0
2      50.0
3      50.0
4     -50.0
      ...
7     100.0
8     100.0
9    -400.0
10    200.0
11   -100.0
Name: sales, Length: 12, dtype: float64